export default {
  projections: {
    ГрафикРаботыE: {
      числоЧасов: {
        __caption__: 'Число часов'
      },
      времяНачала: {
        __caption__: 'Время начала'
      },
      времяКонца: {
        __caption__: 'Время конца'
      },
      типЗанятости: {
        __caption__: 'Тип занятости'
      },
      дата: {
        __caption__: 'Дата'
      }
    },
    ГрафикРаботыL: {
      числоЧасов: {
        __caption__: 'Число часов'
      },
      времяНачала: {
        __caption__: 'Время начала'
      },
      времяКонца: {
        __caption__: 'Время конца'
      },
      типЗанятости: {
        __caption__: 'Тип занятости'
      },
      дата: {
        __caption__: 'Дата'
      }
    }
  },
  validations: {
    времяКонца: {
      __caption__: 'Время конца'
    },
    времяНачала: {
      __caption__: 'Время начала'
    },
    дата: {
      __caption__: 'Дата'
    },
    типЗанятости: {
      __caption__: 'Тип занятости'
    },
    числоЧасов: {
      __caption__: 'Число часов'
    }
  }
};
