export default {
  projections: {
    ПроизводительE: {
      код: {
        __caption__: 'Код'
      },
      наименование: {
        __caption__: 'Наименование'
      },
      адрес: {
        __caption__: 'Адрес'
      }
    },
    ПроизводительL: {
      код: {
        __caption__: 'Код'
      },
      наименование: {
        __caption__: 'Наименование'
      },
      адрес: {
        __caption__: 'Адрес'
      }
    }
  },
  validations: {
    адрес: {
      __caption__: 'Адрес'
    },
    код: {
      __caption__: 'Код'
    },
    наименование: {
      __caption__: 'Наименование'
    }
  }
};
