export default {
  projections: {
    СоставУслугиE: {
      количество: {
        __caption__: 'Количество'
      },
      единицы: {
        __caption__: 'Единицы'
      },
      товар: {
        __caption__: 'Товар',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    }
  },
  validations: {
    единицы: {
      __caption__: 'Единицы'
    },
    количество: {
      __caption__: 'Количество'
    },
    товар: {
      __caption__: 'Товар'
    },
    услуга: {
      __caption__: 'услуга'
    }
  }
};
