export default {
  projections: {
    ОтсутствиеE: {
      датаНачала: {
        __caption__: 'Дата начала'
      },
      датаКонца: {
        __caption__: 'Дата конца'
      },
      причина: {
        __caption__: 'Причина'
      },
      комментарий: {
        __caption__: 'Комментарий'
      }
    },
    ОтсутствиеL: {
      датаНачала: {
        __caption__: 'Дата начала'
      },
      датаКонца: {
        __caption__: 'Дата конца'
      },
      причина: {
        __caption__: 'Причина'
      },
      комментарий: {
        __caption__: 'Комментарий'
      }
    }
  },
  validations: {
    датаКонца: {
      __caption__: 'Дата конца'
    },
    датаНачала: {
      __caption__: 'Дата начала'
    },
    комментарий: {
      __caption__: 'Комментарий'
    },
    причина: {
      __caption__: 'Причина'
    }
  }
};
