export default {
  projections: {
    ВизитE: {
      кодВизита: {
        __caption__: 'Код визита'
      },
      началоСеанса: {
        __caption__: 'Начало сеанса'
      },
      конецСеанса: {
        __caption__: 'Конец сеанса'
      },
      датаВизита: {
        __caption__: 'Дата визита'
      },
      стоимость: {
        __caption__: 'Стоимость'
      },
      клиент: {
        __caption__: 'Клиент',
        фИО: {
          __caption__: 'ФИО'
        }
      },
      записьВизита: {
        __caption__: 'Запись визита',
        комментарий: {
          __caption__: 'Комментарий'
        },
        услуга: {
          __caption__: 'Услуга',
          наименование: {
            __caption__: 'Наименование'
          },
          цена: {
            __caption__: 'Цена'
          }
        },
        сотрудник: {
          __caption__: 'Сотрудник',
          фИО: {
            __caption__: 'ФИО'
          }
        }
      }
    },
    ВизитL: {
      кодВизита: {
        __caption__: 'Код визита'
      },
      началоСеанса: {
        __caption__: 'Начало сеанса'
      },
      конецСеанса: {
        __caption__: 'Конец сеанса'
      },
      датаВизита: {
        __caption__: 'Дата визита'
      },
      стоимость: {
        __caption__: 'Стоимость'
      },
      клиент: {
        __caption__: 'ФИО',
        фИО: {
          __caption__: 'ФИО'
        }
      }
    }
  },
  validations: {
    датаВизита: {
      __caption__: 'Дата визита'
    },
    кодВизита: {
      __caption__: 'Код визита'
    },
    конецСеанса: {
      __caption__: 'Конец сеанса'
    },
    началоСеанса: {
      __caption__: 'Начало сеанса'
    },
    стоимость: {
      __caption__: 'Стоимость'
    },
    клиент: {
      __caption__: 'Клиент'
    },
    записьВизита: {
      __caption__: 'Запись визита'
    }
  }
};
