export default {
  projections: {
    сотрудникE: {
      фИО: {
        __caption__: 'ФИО'
      },
      кодСотрудника: {
        __caption__: 'Код сотрудника'
      },
      датаРождения: {
        __caption__: 'Дата рождения'
      },
      номерТелефона: {
        __caption__: 'Номер телефона'
      },
      пол: {
        __caption__: 'Пол'
      },
      графикРаботы: {
        __caption__: 'График работы',
        числоЧасов: {
          __caption__: 'Число часов'
        }
      },
      должности: {
        __caption__: 'Должности',
        должность: {
          __caption__: 'Должность'
        }
      },
      отсутствие: {
        __caption__: 'Отсутствие',
        комментарий: {
          __caption__: 'Комментарий'
        }
      },
      услугиМастера: {
        __caption__: 'Услуги мастера',
        услуга: {
          __caption__: 'Услуга',
          наименование: {
            __caption__: 'Наименование'
          }
        }
      }
    },
    сотрудникL: {
      фИО: {
        __caption__: 'ФИО'
      },
      кодСотрудника: {
        __caption__: 'Код сотрудника'
      },
      датаРождения: {
        __caption__: 'Дата рождения'
      },
      номерТелефона: {
        __caption__: 'Номер телефона'
      },
      пол: {
        __caption__: 'Пол'
      },
      графикРаботы: {
        __caption__: 'Число часов',
        числоЧасов: {
          __caption__: 'Число часов'
        }
      },
      должности: {
        __caption__: 'Должность',
        должность: {
          __caption__: 'Должность'
        }
      },
      отсутствие: {
        __caption__: 'Комментарий',
        комментарий: {
          __caption__: 'Комментарий'
        }
      }
    }
  },
  validations: {
    датаРождения: {
      __caption__: 'Дата рождения'
    },
    кодСотрудника: {
      __caption__: 'Код сотрудника'
    },
    номерТелефона: {
      __caption__: 'Номер телефона'
    },
    пол: {
      __caption__: 'Пол'
    },
    фИО: {
      __caption__: 'ФИО'
    },
    графикРаботы: {
      __caption__: 'График работы'
    },
    должности: {
      __caption__: 'Должности'
    },
    отсутствие: {
      __caption__: 'Отсутствие'
    },
    услугиМастера: {
      __caption__: 'Услуги мастера'
    }
  }
};
